In [1]:
import pandas as pd
frame = pd.DataFrame({'numbers':range(10), 'chars':['a']*10})
frame

  chars  numbers
0     a        0
1     a        1
2     a        2
3     a        3
4     a        4
5     a        5
6     a        6
7     a        7
8     a        8
9     a        9

In [3]:
frame = pd.read_csv('dataset.tsv', header=0, sep='\t')
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [8]:
frame.columns

Index([u'Name', u'Birth', u'City', u'Position'], dtype='object')

In [9]:
frame.shape

(6, 4)

In [11]:
frame.append({'name':"Evgeniy", 'Bith':'13.08.1989', 'City':"Kharkiv"},ignore_index=True)

              Name       Birth       City  Position        Bith     name
0      Иванов А.А.  22.03.1980     Москва       NaN         NaN      NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер         NaN      NaN
2       Белов М.М.  13.02.1980     Ростов  менеджер         NaN      NaN
3  Мельникова Д.С.  15.04.1985     Ростов       NaN         NaN      NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер         NaN      NaN
5     Костров С.О.  31.05.1985     Москва    стажер         NaN      NaN
6              NaN         NaN    Kharkiv       NaN  13.08.1989  Evgeniy

In [12]:
frame.append({'Name':"Evgeniy1", 'Birth':'13.08.1989', 'City':"Kharkiv"},ignore_index=True)

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6         Evgeniy1  13.08.1989    Kharkiv       NaN

In [13]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [14]:
frame = frame.append({'Name':"Evgeniy1", 'Birth':'13.08.1989', 'City':"Kharkiv"},ignore_index=True)

In [15]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6         Evgeniy1  13.08.1989    Kharkiv       NaN

In [16]:
frame["IsStudent"] = [False]*5+[True]*2

In [17]:
frame

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN      False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      False
2       Белов М.М.  13.02.1980     Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      False
4      Рыбина Е.П.  19.11.1985     Москва   инженер      False
5     Костров С.О.  31.05.1985     Москва    стажер       True
6         Evgeniy1  13.08.1989    Kharkiv       NaN       True

In [18]:
frame.drop([5,6], axis=0)

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN      False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      False
2       Белов М.М.  13.02.1980     Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      False
4      Рыбина Е.П.  19.11.1985     Москва   инженер      False

In [19]:
frame

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN      False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      False
2       Белов М.М.  13.02.1980     Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      False
4      Рыбина Е.П.  19.11.1985     Москва   инженер      False
5     Костров С.О.  31.05.1985     Москва    стажер       True
6         Evgeniy1  13.08.1989    Kharkiv       NaN       True

In [20]:
frame.drop([5,6], axis=0, inplace=True)

In [21]:
frame

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN      False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      False
2       Белов М.М.  13.02.1980     Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      False
4      Рыбина Е.П.  19.11.1985     Москва   инженер      False

In [22]:
frame.drop("IsStudent", axis=1, inplace =True)

In [23]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер

In [24]:
frame.to_csv('demotest.csv', sep=',', header=True, index=None)

In [26]:
frame = pd.read_csv('dataset.tsv',header=0, sep='\t')

In [27]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [28]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [29]:
frame.Birth = frame.Birth.apply(pd.to_datetime)

In [30]:
frame

              Name      Birth       City  Position
0      Иванов А.А. 1980-03-22     Москва       NaN
1     Сорокин И.В. 1965-07-08  Волгоград   инженер
2       Белов М.М. 1980-02-13     Ростов  менеджер
3  Мельникова Д.С. 1985-04-15     Ростов       NaN
4      Рыбина Е.П. 1985-11-19     Москва   инженер
5     Костров С.О. 1985-05-31     Москва    стажер

In [31]:
frame.dtypes

Name                object
Birth       datetime64[ns]
City                object
Position            object
dtype: object

In [32]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name        6 non-null object
Birth       6 non-null datetime64[ns]
City        6 non-null object
Position    4 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 264.0+ bytes

In [33]:
frame.fillna("Разнорабочий", inplace = True)

In [34]:
frame

              Name      Birth       City      Position
0      Иванов А.А. 1980-03-22     Москва  Разнорабочий
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  Разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер

In [35]:
frame.Position

0    Разнорабочий
1         инженер
2        менеджер
3    Разнорабочий
4         инженер
5          стажер
Name: Position, dtype: object

In [36]:
frame[["Position"]]

       Position
0  Разнорабочий
1       инженер
2      менеджер
3  Разнорабочий
4       инженер
5        стажер

In [37]:
frame[['Name',"Position"]]

              Name      Position
0      Иванов А.А.  Разнорабочий
1     Сорокин И.В.       инженер
2       Белов М.М.      менеджер
3  Мельникова Д.С.  Разнорабочий
4      Рыбина Е.П.       инженер
5     Костров С.О.        стажер

In [38]:
frame.head(3)

           Name      Birth       City      Position
0   Иванов А.А. 1980-03-22     Москва  Разнорабочий
1  Сорокин И.В. 1965-07-08  Волгоград       инженер
2    Белов М.М. 1980-02-13     Ростов      менеджер

In [40]:
frame[:1]

          Name      Birth    City      Position
0  Иванов А.А. 1980-03-22  Москва  Разнорабочий

In [42]:
frame[-3:]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  Разнорабочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5     Костров С.О. 1985-05-31  Москва        стажер

In [45]:
frame.loc[[1,3,5],["Name","City"]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [46]:
frame.iloc[[1,3,5],[0,2]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [47]:
frame.ix[[1,3,5], ["Name","City"]]

C:\Users\evges\Anaconda2\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [48]:
frame.ix[[1,3,5],[0,2]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [49]:
frame[frame.Birth>=pd.datetime(1985,1,1)]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  Разнорабочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5     Костров С.О. 1985-05-31  Москва        стажер

In [52]:
frame[(frame.Birth>=pd.datetime(1985,1,1)) & (frame.City!='Москва')]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  Разнорабочий

In [55]:
frame[(frame.Birth>=pd.datetime(1985,1,1)) | (frame.City == 'Волгоград')]

              Name      Birth       City      Position
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
3  Мельникова Д.С. 1985-04-15     Ростов  Разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер

In [66]:
import numpy as np
x=[2,3,4,5]
y=np.array(x)
print(x)
print(y)

[2, 3, 4, 5]
[2 3 4 5]

In [61]:
print(x[1:3])

[3, 4]

In [68]:
print(y[1:3])

[3 4]

In [69]:
#print x[[0, 2]]

print y[[0, 2]]

[2 4]

In [70]:
y[y>3]

array([4, 5])

In [71]:
print (x*5)
print(y*5)

[2, 3, 4, 5, 2, 3, 4, 5, 2, 3, 4, 5, 2, 3, 4, 5, 2, 3, 4, 5]
[10 15 20 25]

In [72]:
print x**2

TypeError: unsupported operand type(s) for ** or pow(): 'list' and 'int'

In [73]:
print y **2

[ 4  9 16 25]

In [76]:
matrix = [[1,2,3], [3,1,0]]
nd_array = np.array(matrix)

In [75]:
print (nd_array)

[[1 2 3]
 [3 1 0]]

In [77]:
print matrix[1][2]

0

In [78]:
print nd_array[1,2]

0

In [82]:
print np.random.rand()

0.735459147883

In [81]:
print np.random.randn()

-0.804871791817

In [83]:
print np.random.randn(4)

[0.5732791  2.28988326 0.02498826 0.57779254]

In [84]:
print np.random.randn(4,5)

[[-2.29443928 -0.78803674 -0.9025861  -1.60071771 -1.25672624]
 [ 0.73286847  0.29882337  0.63023481 -3.40151481  1.11378383]
 [ 0.24087794 -0.59434332 -0.49428209 -0.74745851 -1.16493076]
 [ 0.80652602 -0.37713145  1.67259391 -1.1978504  -1.1990459 ]]

In [85]:
print np.arange(0,8,0.1)

[0.  0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1.  1.1 1.2 1.3 1.4 1.5 1.6 1.7
 1.8 1.9 2.  2.1 2.2 2.3 2.4 2.5 2.6 2.7 2.8 2.9 3.  3.1 3.2 3.3 3.4 3.5
 3.6 3.7 3.8 3.9 4.  4.1 4.2 4.3 4.4 4.5 4.6 4.7 4.8 4.9 5.  5.1 5.2 5.3
 5.4 5.5 5.6 5.7 5.8 5.9 6.  6.1 6.2 6.3 6.4 6.5 6.6 6.7 6.8 6.9 7.  7.1
 7.2 7.3 7.4 7.5 7.6 7.7 7.8 7.9]

In [86]:
%timeit np.arange(0,1000)
%timeit range(0,1000)

The slowest run took 18.07 times longer than the fastest. This could mean that an intermediate result is being cached.
1000000 loops, best of 3: 1.2 µs per loop
100000 loops, best of 3: 6.43 µs per loop

In [88]:
range(1,101)**2

TypeError: unsupported operand type(s) for ** or pow(): 'list' and 'int'